{
    "basic_info": {
        "description_header": "Hi",
        "description": "👋 Hi, I'm Gustavo, a web development technician and Computer Science student. Currently, I'm working as a SENAI scholarship holder at the startup Strokmatic, where I engage in image processing, artificial intelligence, and industrial software development. This experience has provided me the opportunity to apply and expand my knowledge in innovative and challenging areas. In the past, I was a competitive programmer, a phase that helped me develop skills in solving complex problems. My interests extend to the fields of information technology and artificial intelligence 🤖, where I'm always eager to explore new concepts and innovations. Whether it's developing cutting-edge applications or diving into the latest AI research, I'm committed to staying at the forefront of the industry and contributing to a future where technology empowers and inspires.",
        "section_name": {
            "about": "About me",
            "projects": "Projects",
            "skills": "Skills",
            "experience": "Experience",
            "contact": "Contact Me"
        }
    },
    "projects": [
        {
            "title": "Julia Language for Beginners",
            "startDate": "2022",
            "description": "With a friend from the Mechanical Engineering course, I taught a complete course on the Julia Programming Language during the Integrated Events Week at the Universidade do Estado de Santa Catarina. The course was open to all ages and to people inside and outside the institution.",
            "images": [
                "images/projects/julia-course/IMG_20221018_174932.jpg",
                "images/projects/julia-course/IMG_20221019_183914.jpg"
            ],
            "url": "https://github.com/thelostgus/curso-julia-sei-2022",
            "technologies": [
                {
                    "class": "devicon-julia-plain",
                    "name": "Julia"
                }
            ]
        },
        {
    "title": "Implementation of Laplacian Edge Detection in image-rs/imageproc",
    "startDate": "2023",
    "description": "I contributed to the image-rs/imageproc project on GitHub by implementing two new builder structures, Laplacian and LaplacianEdgeDetector, for Laplacian edge detection on grayscale images. The Laplacian structure allows users to apply a Laplacian filter to a grayscale image, with the option to use the standard Laplacian kernel or apply a diagonal adjustment to emphasize diagonal edges. The LaplacianEdgeDetector structure expands on this functionality, providing a complete edge detection solution, with customizations for the process such as the sigma value for Gaussian blur and the edge threshold value. These additions make it easy for users to perform Laplacian edge detection with just a few lines of code, offering flexibility and seamless integration with existing functions within the project. I believe these enhancements are a valuable addition to the project and will help users achieve better edge detection results.",
    "url": "https://github.com/image-rs/imageproc/pull/516",
    "images": [
                "images/projects/laplacian-edge/ovo1.jpeg",
                "images/projects/laplacian-edge/ovo2.jpeg",
                "images/projects/laplacian-edge/ovo3.jpeg"
            ],
    "technologies": [
        {
            "class": "devicon-rust-plain",
            "name": "Rust"
        }
    ]
}

    ],
    "experience": [
        {
    "company": "SENAI - Strokmatic",
    "title": "Fellow in Artificial Intelligence, Computer Vision, and Industrial Software Development",
    "years": "12.2022 - Present",
    "icon": "devicon-python-plain",
    "mainTech": [
        "Python"
    ],
    "technologies": [
        "Python",
        "C++",
        "PostgreSQL",
        "Redis",
        "OpenCV",
        "Tensorflow",
        "Docker",
        "Git",
        "Linux"
    ]
},

        {
            "company": "UDESC",
            "title": "Graph Theory Monitor",
            "years": "07.2022 - 07-2023",
            "icon": "devicon-cplusplus-plain",
            "mainTech": [
                "C"
            ],
            "technologies": [
                "Python",
                "C",
                "C++",
                "Rust"
            ]
        },
        {
            "company": "Devellop Labs",
            "title": "Junior Full Stack Developer",
            "years": "05.2021 - 12.2021",
            "icon": "fab fa-php",
            "mainTech": [
                "Php 7.3/8.0"
            ],
            "technologies": [
                "Magento 1/2",
                "Openmange",
                "Docker",
                "Wordpress",
                "MySQL",
                "JavaScript",
                "JQuery"
            ]
        },
        {
            "company": "UDESC",
            "title": "Data Structure Monitor",
            "years": "05.2019 - 05.2021",
            "icon": "devicon-cplusplus-plain",
            "mainTech": [
                "C"
            ],
            "technologies": [
                "Python",
                "C",
                "C++"
            ]
        }
    ]
}