{
    "basic_info": {
        "description_header": "Ola, muito Prazer",
        "description": "👋 Olá, sou Gustavo, técnico em desenvolvimento web e estudante de Ciência da Computação. Atualmente, trabalho como bolsista SENAI na startup Strokmatic, onde me envolvo com processamento de imagem, inteligência artificial e desenvolvimento de software industrial. Essa experiência tem me proporcionado a oportunidade de aplicar e expandir meus conhecimentos em áreas inovadoras e desafiadoras. No passado, atuei como programador competitivo, uma fase que me ajudou a desenvolver habilidades de resolução de problemas complexos. Meus interesses se estendem aos campos da tecnologia da informação e inteligência artificial 🤖, onde estou sempre ansioso para explorar novos conceitos e inovações. Seja desenvolvendo aplicações de ponta ou mergulhando nas últimas pesquisas de IA, estou comprometido em permanecer na vanguarda da indústria e contribuir para um futuro onde a tecnologia capacita e inspira.",
        "section_name": {
            "about": "Sobre mim",
            "projects": "Projetos",
            "skills": "Habilidades",
            "experience": "Experiência",
            "contact": "Entre em contato comigo"
        }
    },
    "projects": [
        {
            "title": "Curso Linguagem Julia",
            "startDate": "2022",
            "description": "Ministrei junto a um amigo do curso de Engenharia Mecanica um curso completo sobre a Linguagem de Programação Julia durante a Semana de Eventos Integrados na Universidade do Estado de Santa Catarina. O curso era aberto para todas as idades e para pessoas de dentro e fora da instituição.",
            "images": [
                "images/projects/julia-course/IMG_20221018_174932.jpg",
                "images/projects/julia-course/IMG_20221019_183914.jpg"
            ],
            "url": "https://github.com/thelostgus/curso-julia-sei-2022",
            "technologies": [
                {
                    "class": "devicon-julia-plain",
                    "name": "Julia"
                }
            ]
        },
        {
    "title": "Implementação de Detecção de Borda Laplaciana no image-rs/imageproc",
    "startDate": "2023",
    "description": "Contribuí para o projeto image-rs/imageproc no GitHub, implementando duas novas estruturas de construtor, Laplacian e LaplacianEdgeDetector, para detecção de bordas Laplacianas em imagens em escala de cinza. A estrutura Laplacian permite aos usuários aplicar um filtro Laplaciano a uma imagem em escala de cinza, com a opção de usar o kernel Laplaciano padrão ou aplicar um ajuste diagonal para enfatizar as bordas diagonais. A estrutura LaplacianEdgeDetector expande a funcionalidade, fornecendo uma solução completa de detecção de borda, com personalizações para o processo, como o valor sigma para desfoque Gaussiano e o valor de limiar de borda. Essas adições tornam fácil para os usuários realizar detecção de borda Laplaciana com apenas algumas linhas de código, oferecendo flexibilidade e integração perfeita com as funções existentes no projeto. Acredito que essas melhorias são uma adição valiosa ao projeto e ajudarão os usuários a alcançar melhores resultados na detecção de bordas.",
    "url": "https://github.com/image-rs/imageproc/pull/516",
    "images": [
                "images/projects/laplacian-edge/ovo1.jpeg",
                "images/projects/laplacian-edge/ovo2.jpeg",
                "images/projects/laplacian-edge/ovo3.jpeg"
            ],
    "technologies": [
        {
            "class": "devicon-rust-plain",
            "name": "Rust"
        }
    ]
}

    ],
    "experience": [
        {
            "company": "SENAI - Strokmatic",
            "title": "Bolsista em Inteligência Artificial, Visão Computacional e Desenvolvimento de Software Industrial",
            "years": "12.2022 - Atualmente",
            "icon": "devicon-python-plain",
            "mainTech":[
                "Python"
            ],
            "technologies":[
                "Python",
                "C++",
                "PostgresSQL",
                "Redis",
                "OpenCV",
                "Tensorflow",
                "Docker",
                "Git",
                "Linux"
            ]
        },
        {
            "company": "UDESC",
            "title": "Monitor Teoria dos Grafos",
            "years": "07.2022 - 07-2023",
            "icon": "devicon-cplusplus-plain",
            "mainTech":[
                "C"
            ],
            "technologies":[
                "Python",
                "C",
                "C++",
                "Rust"
            ]
        },
        {
            "company": "Devellop Labs",
            "title": "Desenvolvedor Full Stack Junior",
            "years": "05.2021 - 12.2021",
            "icon": "fab fa-php",
            "mainTech":[
                "Php 7.3/8.0"
            ],
            "technologies":[
                "Magento 1/2",
                "Openmange",
                "Docker",
                "Wordpress",
                "MySQL",
                "JavaScript",
                "JQuery"
            ]
        },
        {
            "company": "UDESC",
            "title": "Monitor Estrutura de Dados",
            "years": "05.2019 - 05.2021",
            "icon": "devicon-cplusplus-plain",
            "mainTech": [
                "C"
            ],
            "technologies": [
                "Python",
                "C",
                "C++"
            ]
            
        }
    ]
}